CSI API ETABS v1
cPointObj.GetLabelFromName Method
 Retrieves the label and story for a unique point object name
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLabelFromName(
	string Name,
	ref string Label,
	ref string Story
)
Function GetLabelFromName (
	Name As String,
	ByRef Label As String,
	ByRef Story As String
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim Label As String
Dim Story As String
Dim returnValue As Integer
returnValue = instance.GetLabelFromName(Name,
	Label, Story)
int GetLabelFromName(
	String^ Name,
	String^% Label,
	String^% Story
)
abstract GetLabelFromName :
        Name : string *
        Label : string byref *
        Story : string byref -> int
Parameters
Name
Type: System.String
 The name of the point object
Label
Type: System.String
 The point object label
Story
Type: System.String
 The point object story level
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved, otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim NumberNames As Integer
   Dim Label As String
   Dim Story As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'get area object data
   ret = SapModel.PointObj.GetLabelFromName("42", Label, Story)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cPointObj Interface
ETABSv1 Namespace